Autodesk.Revit.DB.ThermalAsset.Equals(Autodesk.Revit.DB.ThermalAsset)
Determines whether this thermal asset is equal to another.
other:
The thermal asset to compare with this one.
Returns:
True if the given thermal asset is equal to this one, otherwise false.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.ThermalAsset.Copy
Produces a copy of the asset.
Returns:
A copy of the asset.
Since:
2013

Autodesk.Revit.DB.ThermalAsset.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.ThermalAsset.Name
The name of the thermal asset.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.ThermalAsset.Behavior
Flag indicating whether elements of this material behave isotropically or orthotropically.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2013

Autodesk.Revit.DB.ThermalAsset.ThermalConductivity
The thermal conductivity of the asset.
Remarks:
Values are in feet-kilograms per Kelvin-cubed-second ((ft · kg)/(K · s³)) and must be non-negative.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The given value for thermalConductivity must be non-negative.
Since:
2013

Autodesk.Revit.DB.ThermalAsset.Density
The density of the asset.
Remarks:
Values are in kilograms per cubed feet (kg/ft³) and must be non-negative.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The given value for density must be non-negative.
Since:
2013

Autodesk.Revit.DB.ThermalAsset.ElectricalResistivity
The electrical resistivity of the asset.
Remarks:
Values are in ohm-meters and must be non-negative.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The given value for electricalResistivity must be non-negative.
Since:
2013

Autodesk.Revit.DB.ThermalAsset.Reflectivity
The reflectivity of the asset.
Remarks:
Values must be in the range 0 to 1.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The given value for reflectivity is out of range
Since:
2013

Autodesk.Revit.DB.ThermalAsset.Porosity
The porosity of the asset.
Remarks:
Values must be in the range 0 to 1.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The given value for porosity is out of range
Since:
2013

Autodesk.Revit.DB.ThermalAsset.Permeability
The permeability of the asset.
Remarks:
Values are in seconds per foot (s/ft) and must be non-negative.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The given value for permeability must be non-negative.
Since:
2013

Autodesk.Revit.DB.ThermalAsset.TransmitsLight
A boolean flag that indicates whether or not the asset transmits light.
Since:
2013

Autodesk.Revit.DB.ThermalAsset.VaporPressure
The vapor pressure of the asset.
Remarks:
Values are in kilograms per feet, squared-second (kg/(ft · s²)) and must be non-negative.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The given value for vaporPressure must be non-negative.
Since:
2013

Autodesk.Revit.DB.ThermalAsset.SpecificHeat
The specific heat of the asset.
Remarks:
Values are in squared-feet per Kelvin, squared-second (ft²/(K · s²)) and must be non-negative.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The given value for specificHeat must be non-negative.
Since:
2014

Autodesk.Revit.DB.ThermalAsset.SpecificHeatOfVaporization
The specific heat of vaporization of the asset.
Remarks:
Values are in feet per squared-second (ft/s²) and must be non-negative.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The given value for specificHeatOfVaporization must be non-negative.
Since:
2013

Autodesk.Revit.DB.ThermalAsset.LiquidViscosity
The liquid viscosity of the asset.
Remarks:
Values are in kilograms per feet-second (kg/(ft · s)) and must be non-negative.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The given value for liquidViscosity must be non-negative.
Throws Autodesk.Revit.Exceptions.InapplicableDataException:
When setting this property: the asset must be liquid to set this property.
Since:
2013

Autodesk.Revit.DB.ThermalAsset.Compressibility
The compressibility of the asset.
Remarks:
Values must be in the range 0 to 1.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The given value for compressibility is out of range
Since:
2013

Autodesk.Revit.DB.ThermalAsset.GasViscosity
The gas viscosity of the asset.
Remarks:
Values are in kilograms per feet-second (kg/(ft · s)) and must be non-negative.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The given value for gasViscosity must be non-negative.
Throws Autodesk.Revit.Exceptions.InapplicableDataException:
When setting this property: the asset must be gas to set this property.
Since:
2013

Autodesk.Revit.DB.ThermalAsset.Emissivity
The emissivity of the asset.
Remarks:
Values must be in the range 0 to 1.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The given value for emissivity is out of range
Since:
2013

Autodesk.Revit.DB.ThermalAsset.ThermalMaterialType
The type of material that this thermal asset describes (e.g. solid, liquid, gas.)
Since:
2013

Autodesk.Revit.DB.ThermalAsset.#ctor(System.String,Autodesk.Revit.DB.ThermalMaterialType)
Constructs an instance of ThermalAsset.
name:
The name of the asset.
materialType:
The type of thermal material that this asset will describe.
Throws Autodesk.Revit.Exceptions.ArgumentException:
name is an empty string.
-or-
name cannot include prohibited characters.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2013

Autodesk.Revit.DB.ThermalAsset
Represents the properties of a material pertinent to energy analysis.
Since:
2013